#**************************************************************
# This .sdc file is created by Terasic Tool.
# Users are recommended to modify this file to match users logic.
#**************************************************************

#**************************************************************
# Create Clock
#**************************************************************
#create_clock -period 20.000ns [get_ports CLOCK_50]
#create_clock -period 20.000ns [get_ports CLOCK2_50]
#create_clock -period 20.000ns [get_ports CLOCK3_50]

create_clock -name {Clk} -period 20.000 -waveform { 0.000 10.000 } [get_ports {CLOCK2_50}]

# VGA : 800x600@60Hz
#create_clock -period "40.0 MHz" -name clk_vga [get_ports VGA_CLK]

#**************************************************************
# Create Generated Clock
#**************************************************************
derive_pll_clocks



#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************
derive_clock_uncertainty



#**************************************************************
# Set Input Delay
#**************************************************************
#set_input_delay -clock {Clk} -max 3 [all_inputs]
#set_input_delay -clock {Clk} -min 2 [all_inputs]


#**************************************************************
# Set Output Delay
#**************************************************************
#set_output_delay -clock {Clk} 2 [all_outputs]


#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************



#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************



#**************************************************************
# Set Load
#**************************************************************
